In [1]:
import pandas as pd

In [2]:
titanic_data = pd.read_csv("./data/tested.csv")
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [3]:
titanic_data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [6]:
col_names = titanic_data.columns
col_names

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
col_names_new = ['Id', 'Survived', 'Passenger Class', 'Full Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket Number', 'Fare', 'Cabin', 'Station']

In [10]:
titanic_data = pd.read_csv("./data/tested.csv",names = col_names_new,skiprows=[0])
titanic_data

,Id,Survived,Passenger Class,Full Name,Gender,Age,SibSp,Parch,Ticket Number,Fare,Cabin,Station
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [14]:
titanic_data = pd.read_csv("./data/tested.csv",skiprows=[0],header=None)
titanic_data

,0,1,2,3,4,5,6,7,8,9,10,11
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [19]:
dict_fruit={
    "Mango":pd.Series([4,5,6,3,1],index = [0,1,2,3,4]),
    "Apple":pd.Series([5,4,3,0,2],index = [0,1,2,3,4]),
    "Banana":pd.Series([2,3,5,2,7],index = [0,1,2,3,5])
}
df_fruit = pd.DataFrame(dict)
# df_fruit.to_csv("./data/fruit.csv")
# df_fruit.to_csv("./data/fruit.csv",index=False)
# df_fruit.to_csv("./data/fruit.csv",index = False, sep = ";")
df_fruit.to_csv("./data/fruit.csv",)

In [20]:
import json

In [36]:
data = '''[
    {"name": "Tuấn Anh", "gender": "Female", "birthday": "1990-05-15", "score": 85},
    {"name": "Hải", "gender": "Male", "birthday": "1988-11-20", "score": 92},
    {"name": "Charlie", "gender": "Male", "birthday": "1995-02-10", "score": 78},
    {"name": "David", "gender": "Male", "birthday": "1992-08-05", "score": 89}
]'''
# print(data)
json_object = json.loads(data)
json_object

[{'name': 'Tuấn Anh',
  'gender': 'Female',
  'birthday': '1990-05-15',
  'score': 85},
 {'name': 'Hải', 'gender': 'Male', 'birthday': '1988-11-20', 'score': 92},
 {'name': 'Charlie', 'gender': 'Male', 'birthday': '1995-02-10', 'score': 78},
 {'name': 'David', 'gender': 'Male', 'birthday': '1992-08-05', 'score': 89}]

In [37]:
# Define the output file path
output_file = "./data/data.json"

# Save the JSON data to a file
with open(output_file, "w", encoding="utf-8") as json_file:
    json.dump(json_object, json_file, ensure_ascii=False)

In [38]:
data_2 = {"name": "Tuấn Anh", "gender": "Female", "birthday": "1990-05-15", "score": 85}
output_file = "./data/data.json"

# Save the JSON data to a file
with open(output_file, "w", encoding="utf-8") as json_file:
    json.dump(data_2, json_file, ensure_ascii=False)